ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/CONTROLSS_MDLXBAR_CONTROLSS_502D3000h.xml
<module name="CONTROLSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_MDLXBAR0_G0" acronym="CONTROLSS_MDLXBAR0_G0" offset="256" width="32" description="MDL XBAR 0 Input Select.">
		<bitfield id="MDLXBAR0_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR0 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR0_G1" acronym="CONTROLSS_MDLXBAR0_G1" offset="260" width="32" description="MDL XBAR 0 Input Select.">
		<bitfield id="MDLXBAR0_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR0 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR0_G2" acronym="CONTROLSS_MDLXBAR0_G2" offset="264" width="32" description="MDL XBAR 0 Input Select.">
		<bitfield id="MDLXBAR0_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR0 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR1_G0" acronym="CONTROLSS_MDLXBAR1_G0" offset="320" width="32" description="MDL XBAR 1 Input Select.">
		<bitfield id="MDLXBAR1_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR1 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR1_G1" acronym="CONTROLSS_MDLXBAR1_G1" offset="324" width="32" description="MDL XBAR 1 Input Select.">
		<bitfield id="MDLXBAR1_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR1 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR1_G2" acronym="CONTROLSS_MDLXBAR1_G2" offset="328" width="32" description="MDL XBAR 1 Input Select.">
		<bitfield id="MDLXBAR1_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR1 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR2_G0" acronym="CONTROLSS_MDLXBAR2_G0" offset="384" width="32" description="MDL XBAR 2 Input Select.">
		<bitfield id="MDLXBAR2_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR2 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR2_G1" acronym="CONTROLSS_MDLXBAR2_G1" offset="388" width="32" description="MDL XBAR 2 Input Select.">
		<bitfield id="MDLXBAR2_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR2 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR2_G2" acronym="CONTROLSS_MDLXBAR2_G2" offset="392" width="32" description="MDL XBAR 2 Input Select.">
		<bitfield id="MDLXBAR2_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR2 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR3_G0" acronym="CONTROLSS_MDLXBAR3_G0" offset="448" width="32" description="MDL XBAR 3 Input Select.">
		<bitfield id="MDLXBAR3_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR3 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR3_G1" acronym="CONTROLSS_MDLXBAR3_G1" offset="452" width="32" description="MDL XBAR 3 Input Select.">
		<bitfield id="MDLXBAR3_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR3 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR3_G2" acronym="CONTROLSS_MDLXBAR3_G2" offset="456" width="32" description="MDL XBAR 3 Input Select.">
		<bitfield id="MDLXBAR3_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR3 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR4_G0" acronym="CONTROLSS_MDLXBAR4_G0" offset="512" width="32" description="MDL XBAR 4 Input Select.">
		<bitfield id="MDLXBAR4_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR4 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR4_G1" acronym="CONTROLSS_MDLXBAR4_G1" offset="516" width="32" description="MDL XBAR 4 Input Select.">
		<bitfield id="MDLXBAR4_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR4 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR4_G2" acronym="CONTROLSS_MDLXBAR4_G2" offset="520" width="32" description="MDL XBAR 4 Input Select.">
		<bitfield id="MDLXBAR4_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR4 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR5_G0" acronym="CONTROLSS_MDLXBAR5_G0" offset="576" width="32" description="MDL XBAR 5 Input Select.">
		<bitfield id="MDLXBAR5_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR5 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR5_G1" acronym="CONTROLSS_MDLXBAR5_G1" offset="580" width="32" description="MDL XBAR 5 Input Select.">
		<bitfield id="MDLXBAR5_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR5 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR5_G2" acronym="CONTROLSS_MDLXBAR5_G2" offset="584" width="32" description="MDL XBAR 5 Input Select.">
		<bitfield id="MDLXBAR5_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR5 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR6_G0" acronym="CONTROLSS_MDLXBAR6_G0" offset="640" width="32" description="MDL XBAR 6 Input Select.">
		<bitfield id="MDLXBAR6_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR6 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR6_G1" acronym="CONTROLSS_MDLXBAR6_G1" offset="644" width="32" description="MDL XBAR 6 Input Select.">
		<bitfield id="MDLXBAR6_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR6 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR6_G2" acronym="CONTROLSS_MDLXBAR6_G2" offset="648" width="32" description="MDL XBAR 6 Input Select.">
		<bitfield id="MDLXBAR6_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR6 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR7_G0" acronym="CONTROLSS_MDLXBAR7_G0" offset="704" width="32" description="MDL XBAR 7 Input Select.">
		<bitfield id="MDLXBAR7_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR7 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR7_G1" acronym="CONTROLSS_MDLXBAR7_G1" offset="708" width="32" description="MDL XBAR 7 Input Select.">
		<bitfield id="MDLXBAR7_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR7 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR7_G2" acronym="CONTROLSS_MDLXBAR7_G2" offset="712" width="32" description="MDL XBAR 7 Input Select.">
		<bitfield id="MDLXBAR7_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR7 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR8_G0" acronym="CONTROLSS_MDLXBAR8_G0" offset="768" width="32" description="MDL XBAR 8 Input Select.">
		<bitfield id="MDLXBAR8_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR8 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR8_G1" acronym="CONTROLSS_MDLXBAR8_G1" offset="772" width="32" description="MDL XBAR 8 Input Select.">
		<bitfield id="MDLXBAR8_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR8 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR8_G2" acronym="CONTROLSS_MDLXBAR8_G2" offset="776" width="32" description="MDL XBAR 8 Input Select.">
		<bitfield id="MDLXBAR8_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR8 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR9_G0" acronym="CONTROLSS_MDLXBAR9_G0" offset="832" width="32" description="MDL XBAR 9 Input Select.">
		<bitfield id="MDLXBAR9_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR9 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR9_G1" acronym="CONTROLSS_MDLXBAR9_G1" offset="836" width="32" description="MDL XBAR 9 Input Select.">
		<bitfield id="MDLXBAR9_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR9 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR9_G2" acronym="CONTROLSS_MDLXBAR9_G2" offset="840" width="32" description="MDL XBAR 9 Input Select.">
		<bitfield id="MDLXBAR9_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR9 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR10_G0" acronym="CONTROLSS_MDLXBAR10_G0" offset="896" width="32" description="MDL XBAR 10 Input Select.">
		<bitfield id="MDLXBAR10_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR10 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR10_G1" acronym="CONTROLSS_MDLXBAR10_G1" offset="900" width="32" description="MDL XBAR 10 Input Select.">
		<bitfield id="MDLXBAR10_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR10 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR10_G2" acronym="CONTROLSS_MDLXBAR10_G2" offset="904" width="32" description="MDL XBAR 10 Input Select.">
		<bitfield id="MDLXBAR10_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR10 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR11_G0" acronym="CONTROLSS_MDLXBAR11_G0" offset="960" width="32" description="MDL XBAR 11 Input Select.">
		<bitfield id="MDLXBAR11_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR11 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR11_G1" acronym="CONTROLSS_MDLXBAR11_G1" offset="964" width="32" description="MDL XBAR 11 Input Select.">
		<bitfield id="MDLXBAR11_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR11 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR11_G2" acronym="CONTROLSS_MDLXBAR11_G2" offset="968" width="32" description="MDL XBAR 11 Input Select.">
		<bitfield id="MDLXBAR11_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR11 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR12_G0" acronym="CONTROLSS_MDLXBAR12_G0" offset="1024" width="32" description="MDL XBAR 12 Input Select.">
		<bitfield id="MDLXBAR12_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR12 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR12_G1" acronym="CONTROLSS_MDLXBAR12_G1" offset="1028" width="32" description="MDL XBAR 12 Input Select.">
		<bitfield id="MDLXBAR12_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR12 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR12_G2" acronym="CONTROLSS_MDLXBAR12_G2" offset="1032" width="32" description="MDL XBAR 12 Input Select.">
		<bitfield id="MDLXBAR12_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR12 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR13_G0" acronym="CONTROLSS_MDLXBAR13_G0" offset="1088" width="32" description="MDL XBAR 13 Input Select.">
		<bitfield id="MDLXBAR13_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR13 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR13_G1" acronym="CONTROLSS_MDLXBAR13_G1" offset="1092" width="32" description="MDL XBAR 13 Input Select.">
		<bitfield id="MDLXBAR13_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR13 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR13_G2" acronym="CONTROLSS_MDLXBAR13_G2" offset="1096" width="32" description="MDL XBAR 13 Input Select.">
		<bitfield id="MDLXBAR13_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR13 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR14_G0" acronym="CONTROLSS_MDLXBAR14_G0" offset="1152" width="32" description="MDL XBAR 14 Input Select.">
		<bitfield id="MDLXBAR14_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR14 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR14_G1" acronym="CONTROLSS_MDLXBAR14_G1" offset="1156" width="32" description="MDL XBAR 14 Input Select.">
		<bitfield id="MDLXBAR14_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR14 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR14_G2" acronym="CONTROLSS_MDLXBAR14_G2" offset="1160" width="32" description="MDL XBAR 14 Input Select.">
		<bitfield id="MDLXBAR14_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR14 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR15_G0" acronym="CONTROLSS_MDLXBAR15_G0" offset="1216" width="32" description="MDL XBAR 15 Input Select .">
		<bitfield id="MDLXBAR15_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR15 G0 input bit select. Input source is PWMA sclk select1:PWMA sclk bit[x] selected0:PWMA sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR15_G1" acronym="CONTROLSS_MDLXBAR15_G1" offset="1220" width="32" description="MDL XBAR 15 Input Select .">
		<bitfield id="MDLXBAR15_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR15 G1 input bit select. Input source is PWMB sclk select1:PWMB sclk bit[x] selected0:PWMB sclk bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_MDLXBAR15_G2" acronym="CONTROLSS_MDLXBAR15_G2" offset="1224" width="32" description="MDL XBAR 15 Input Select .">
		<bitfield id="MDLXBAR15_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBAR15 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register>
</module>